In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Name' : ["Utkarsh","Kartik","Pratik","Bhavesh","Gaurav","Hrithik","Aniket","Rushikesh","Shubham","Aditya"],
    'Value' : [5,10,np.nan,20,np.nan,30,40,np.nan,50,np.nan]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df)

        Name  Value
0    Utkarsh    5.0
1     Kartik   10.0
2     Pratik    NaN
3    Bhavesh   20.0
4     Gaurav    NaN
5    Hrithik   30.0
6     Aniket   40.0
7  Rushikesh    NaN
8    Shubham   50.0
9     Aditya    NaN

In [5]:
df.isna().sum()

Name     0
Value    4
dtype: int64

In [6]:
df1 = df.copy()
df1['Value'] = df['Value'].fillna(df['Value'].mean())

In [7]:
df1

        Name      Value
0    Utkarsh   5.000000
1     Kartik  10.000000
2     Pratik  25.833333
3    Bhavesh  20.000000
4     Gaurav  25.833333
5    Hrithik  30.000000
6     Aniket  40.000000
7  Rushikesh  25.833333
8    Shubham  50.000000
9     Aditya  25.833333

In [8]:
df2 = df.copy()
df2['Value'] = df['Value'].fillna(df['Value'].median())

In [9]:
print(df1)
print(df2)

        Name      Value
0    Utkarsh   5.000000
1     Kartik  10.000000
2     Pratik  25.833333
3    Bhavesh  20.000000
4     Gaurav  25.833333
5    Hrithik  30.000000
6     Aniket  40.000000
7  Rushikesh  25.833333
8    Shubham  50.000000
9     Aditya  25.833333
        Name  Value
0    Utkarsh    5.0
1     Kartik   10.0
2     Pratik   25.0
3    Bhavesh   20.0
4     Gaurav   25.0
5    Hrithik   30.0
6     Aniket   40.0
7  Rushikesh   25.0
8    Shubham   50.0
9     Aditya   25.0

In [14]:
df_bfill = df.fillna(method='bfill')
print(df_bfill)
df_ffill = df.fillna(method='ffill')
print(df_ffill)

        Name  Value
0    Utkarsh    5.0
1     Kartik   10.0
2     Pratik   20.0
3    Bhavesh   20.0
4     Gaurav   30.0
5    Hrithik   30.0
6     Aniket   40.0
7  Rushikesh   50.0
8    Shubham   50.0
9     Aditya    NaN
        Name  Value
0    Utkarsh    5.0
1     Kartik   10.0
2     Pratik   10.0
3    Bhavesh   20.0
4     Gaurav   20.0
5    Hrithik   30.0
6     Aniket   40.0
7  Rushikesh   40.0
8    Shubham   50.0
9     Aditya   50.0

In [13]:
df_interpolate = df.interpolate()
df_interpolate

        Name  Value
0    Utkarsh    5.0
1     Kartik   10.0
2     Pratik   15.0
3    Bhavesh   20.0
4     Gaurav   25.0
5    Hrithik   30.0
6     Aniket   40.0
7  Rushikesh   45.0
8    Shubham   50.0
9     Aditya   50.0